Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КошелькиПартии</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.Кошельки</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ПокупкиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыОбщие</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДолгов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПрямой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьРасхождениеДолговЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеткаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ШаблоныЧтенияСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ШаблоныЧтенияСМС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКарта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТипОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/БекапЧерезПочту/Ext/Module.bsl
Процедура ВыгрузитьБекапНаПочту(Знач ПараметрыВыгрузки, АдресХранилища = Неопределено) Экспорт
	
	ИмяФайла = ВыгрузитьБекапВФайл();
	
	ПочтовыйПрофиль = РаботаСПочтойКлиентСервер.ПолучитьПрофиль();
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение;
	ПочтовоеСообщение.Тема = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'MyMoney Backup %1 %2 %3'"),
	ПланыОбмена.Мобильные.ЭтотУзел().Наименование, ЗначениеНаСтроекПовтИсп.ПолучитьЗначениеКонстанты("ТекущаяВерсияПриложения"),
	формат(ТекущаяДата(), "ДЛФ=DDT"));
	ПочтовоеСообщение.Отправитель = Константы.АдресПочтыБекапа.Получить();
	ПочтовоеСообщение.Получатели.Добавить(Константы.АдресПочтыБекапа.Получить());
	
	Почта = Новый ИнтернетПочта;
	
	//Попытка		
		Почта.Подключиться(ПочтовыйПрофиль);
	//Исключение		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
	//	Возврат;
	//КонецПопытки;
	
	Если ИмяФайла = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПочтовоеСообщение.Вложения.Добавить(ИмяФайла, "Бекап");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '{СтандартныеПодсистемы.ДлительныеОперации}отправка на почту'"));
	
	Почта.Послать(ПочтовоеСообщение);
	
	Константы.ДатаПоследнегоБекапа.Установить(ТекущаяДата());
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выгрузка бекапа на почту выполнена успешно'"));		
	
КонецПроцедуры

Функция ПроверитьНеобходимостьВыгрузкиБекапаНаПочту(ТекстОтносительнойДатыБекапа = Неопределено) Экспорт 
	
	Если Не ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьБекапНаПочту") Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ПериодичностьБекапа = Константы.ПериодичностьБекапа.Получить();
	
	Если ПериодичностьБекапа = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ДатаПоследнегоДекапа = Константы.ДатаПоследнегоБекапа.Получить();
	
	Если (ТекущаяДата() - Константы.ДатаПоследнегоБекапа.Получить()) / 3600 < ПериодичностьБекапа Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекстОтносительнойДатыБекапа <> Неопределено Тогда 
		ТекстОтносительнойДатыБекапа = ОбщегоНазначенияКлиентСервер.ОтносительнаяДатаСинхронизации(ДатаПоследнегоДекапа);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ВыгрузитьБекапВФайл() Экспорт 
	//попытка
		#Если МобильноеПриложениеСервер Тогда
			Разделитель = "/";
		#Иначе
			Разделитель = "\";    
		#КонецЕсли
		
		Каталог = ЗначениеНаСтроекПовтИсп.ПолучитьЗначениеКонстанты("КаталогХраненияФайлов");
		
		Если Не ЗначениеЗаполнено(Каталог) Тогда			
			ВызватьИсключение НСтр("ru = 'Не указан каталог хранения файлов'");
		КонецЕсли;
		
		// Сформировать имя временного файла.
		ИмяФайла = Каталог + ?(Прав(Каталог, 1) = Разделитель, "", Разделитель) + "BackUp " +
		ЗначениеНаСтроекПовтИсп.ПолучитьЗначениеКонстанты("ТекущаяВерсияПриложения") + " " + Формат(ТекущаяДата(), "ДФ='гггг-ММ-дд ЧЧ-мм-сс'") +
		".xml"; 
		
		МойXML = Новый ЗаписьXML; 
		ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь); 
		МойXML.ОткрытьФайл(ИмяФайла, ПараметрыЗаписиXML); 
		МойXML.ЗаписатьОбъявлениеXML();
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Объект");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '{СтандартныеПодсистемы.ДлительныеОперации}выгружаются справочники: %1'"));
		
		МасКонстант = Новый Массив;
		МасКонстант.Добавить(Метаданные.Константы.АдресПочтыБекапа);
		МасКонстант.Добавить(Метаданные.Константы.ВалютаУчета);
		МасКонстант.Добавить(Метаданные.Константы.ИспользоватьБекапНаПочту);
		МасКонстант.Добавить(Метаданные.Константы.ИспользоватьЧтениеСМСДляСозданияОпераций);
		МасКонстант.Добавить(Метаданные.Константы.ОсновнойКошелек);
		МасКонстант.Добавить(Метаданные.Константы.ОткрыватьЗагрузкуКурсовПриНачалеРаботы);
		МасКонстант.Добавить(Метаданные.Константы.ПериодичностьБекапа);
		МасКонстант.Добавить(Метаданные.Константы.РазмерШрифта);
		МасКонстант.Добавить(Метаданные.Константы.ЧасовойПоясUTC);
		
		Для Каждого КонстантаМета Из МасКонстант Цикл 
			КонстантаМенеджер = Константы[КонстантаМета.Имя].СоздатьМенеджерЗначения();
			КонстантаМенеджер.Прочитать();
			
			ТЗ.Добавить().Объект = КонстантаМенеджер;
		КонецЦикла;
		
		Выборка = Справочники.Валюты.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выборка = Справочники.Статьи.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выборка = Справочники.Кошельки.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выборка = Справочники.Метки.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выборка = Справочники.ФизЛица.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выборка = Справочники.ШаблоныЧтенияСМС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выборка = Документы.ВводОстатков.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТЗ.Добавить().Объект = Выборка.ПолучитьОбъект();
		КонецЦикла;
		
		Выгружено = 0;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Операция.Ссылка
		|ИЗ
		|	Документ.Операция КАК Операция
		|
		|УПОРЯДОЧИТЬ ПО
		|	Операция.Дата");		
		Выборка = Запрос.Выполнить().Выбрать();
		
		КоличествоОпераций = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '{СтандартныеПодсистемы.ДлительныеОперации}Выгружено операций: %1 / %2'"), Выгружено, КоличествоОпераций));
			
			ТЗ.Добавить().Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Выгружено = Выгружено + 1;
		КонецЦикла;
		
		СериализаторXDTO.ЗаписатьXML(МойXML, ТЗ);
		
		МойXML.Закрыть();
		
		Возврат ИмяФайла;
	//Исключение
	//	текстОшибки = ОписаниеОшибки();
	//	
	//	Возврат Неопределено;
	//КонецПопытки;
КонецФункции

Функция ЗагрузитьБекапПочтыНаСервере(Знач ПараметрыВыгрузки, АдресХранилища = Неопределено) Экспорт 
	ЧтениеXML = Новый ЧтениеXML; 
    ЧтениеXML.ОткрытьФайл(ПараметрыВыгрузки.ИмяФайла);
	
	ЗагруженоОбъектов = 0;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = '{СтандартныеПодсистемы.ДлительныеОперации}загружено Объектов: %1'"), ЗагруженоОбъектов));
	
	Менеджеры = ИнициализацияМенеджеров();
	
	Попытка
		Если Не ПараметрыВыгрузки.Свойство("РучнаяЗагрузкаXML") Тогда 
			Результат = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			
			Для Каждого Стр из Результат Цикл
				Стр.Объект.ОбменДанными.Загрузка = Истина;
				
				Стр.Объект.Записать();
				
				Стр.Объект.ОбменДанными.Загрузка = Ложь;
				
				Если Метаданные.Документы.Найти(Стр.Объект.Метаданные()) <> Неопределено Тогда
					Стр.Объект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			КонецЦикла;
		Иначе
			НовЭлем = Неопределено;
			
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Value" Тогда 
					ЗагруженоОбъектов = ЗагруженоОбъектов + 1;
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '{СтандартныеПодсистемы.ДлительныеОперации}загружено Объектов: %1
					|Последний загруженный объект: %2'"), ЗагруженоОбъектов, НовЭлем));
					
					Структ = Новый Структура;
					Атрибут = ЧтениеXML.ЗначениеАтрибута(1);
					
					Если Сред(Атрибут, 6, 8) = "Constant" Тогда 
						Структ.Вставить("ИмяТипаМетаданных", "Константы");
						Структ.Вставить("ИмяМетаданных", Сред(Атрибут, 27));
					ИначеЕсли Сред(Атрибут, 6, 7) = "Catalog" Тогда 
						Структ.Вставить("ИмяТипаМетаданных", "Справочники");
						Структ.Вставить("ИмяМетаданных", Сред(Атрибут, 20));
					ИначеЕсли Сред(Атрибут, 6, 8) = "Document" Тогда 
						Структ.Вставить("ИмяТипаМетаданных", "Документы");
						Структ.Вставить("ИмяМетаданных", Сред(Атрибут, 21));
					КонецЕсли;
					
					Пока Не (ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Value") Цикл
						ЧтениеXML.Прочитать();
						
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "d3p1:Ref" Тогда 
							ЧтениеXML.Прочитать();
							
							Структ.Вставить("Уин", ЧтениеXML.Значение);						
						ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
							ИмяЭлемента = Сред(ЧтениеXML.Имя, 6);
							
							ЧтениеXML.Прочитать();
							
							Структ.Вставить(ИмяЭлемента, ЧтениеXML.Значение);
						КонецЕсли;						
					КонецЦикла;
					
					Если Структ.ИмяТипаМетаданных = "Константы" Тогда 
						КонстантаМенеджер = Константы[Структ.ИмяМетаданных].СоздатьМенеджерЗначения();
						
						ПервыйТип = КонстантаМенеджер.Метаданные().Тип.Типы()[0];
						
						Если ОбщегоНазначения.ЭтоСсылка(ПервыйТип) Тогда 
							Если ЗначениеЗаполнено(Структ.Value) Тогда 
								ЗначениеСсылка = Неопределено;
								
								ТекМенеджер = Менеджеры.Получить(ПервыйТип);
								
								Если ТекМенеджер.ИмяТипа = "Справочник" Тогда
									ЗначениеСсылка = ТекМенеджер.Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Value));
								ИначеЕсли ТекМенеджер.ИмяТипа = "Перечисление" Тогда 
									ЗначениеСсылка = ТекМенеджер.Менеджер[Структ.Value];
								КонецЕсли;
								
								КонстантаМенеджер.Значение = ЗначениеСсылка;
							КонецЕсли;
						Иначе
							КонстантаМенеджер.Значение = Структ.Value;
						КонецЕсли;
						
						КонстантаМенеджер.ОбменДанными.Загрузка = Истина;
						
						КонстантаМенеджер.Записать();
					ИначеЕсли Структ.ИмяТипаМетаданных = "Справочники" Тогда 
						НовСсылка = Справочники[Структ.ИмяМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Уин));
						
						НовЭлем = НовСсылка.ПолучитьОбъект();
						
						Если НовЭлем = Неопределено Тогда 
							Если Структ.Свойство("isFolder") И Структ.isFolder Тогда 
								НовЭлем = Справочники[Структ.ИмяМетаданных].СоздатьГруппу();
							Иначе
								НовЭлем = Справочники[Структ.ИмяМетаданных].СоздатьЭлемент();
							КонецЕсли;
							
							НовСсылка = Справочники[Структ.ИмяМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Уин));
							НовЭлем.УстановитьСсылкуНового(НовСсылка);
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(НовЭлем, Структ);
						
						Если Структ.Свойство("Parent")  Тогда 							
							НовЭлем.Родитель = Справочники[Структ.ИмяМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Parent));
						КонецЕсли;
						
						Для Каждого МетаРеквизит Из НовЭлем.Метаданные().Реквизиты Цикл
							ПервыйТип = МетаРеквизит.Тип.Типы()[0];
							
							Если ОбщегоНазначения.ЭтоСсылка(ПервыйТип) Тогда 
								ТекЗначение = Структ[МетаРеквизит.Имя];
								
								Если ЗначениеЗаполнено(ТекЗначение) Тогда 
									ЗначениеСсылка = Неопределено;
									
									ТекМенеджер = Менеджеры.Получить(ПервыйТип);
									
									Если Справочники.ТипВсеСсылки().СодержитТип(ПервыйТип) Тогда
										ЗначениеСсылка = ТекМенеджер.Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекЗначение));
									ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ПервыйТип) Тогда 
										ЗначениеСсылка = ТекМенеджер.Менеджер[ТекЗначение];
									КонецЕсли;
									
									НовЭлем[МетаРеквизит.Имя] = ЗначениеСсылка;
								КонецЕсли;								
							КонецЕсли;
						КонецЦикла;
						
						НовЭлем.ОбменДанными.Загрузка = Истина;
						
						НовЭлем.Записать();
					ИначеЕсли Структ.ИмяТипаМетаданных = "Документы" Тогда 
						НовСсылка = Документы[Структ.ИмяМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Уин));
						
						НовЭлем = НовСсылка.ПолучитьОбъект();
						
						Если НовЭлем = Неопределено Тогда  
							НовЭлем = Документы[Структ.ИмяМетаданных].СоздатьДокумент();
							
							НовСсылка = Документы[Структ.ИмяМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Уин));
							НовЭлем.УстановитьСсылкуНового(НовСсылка);
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(НовЭлем, Структ);
						
						Если Структ.Свойство("Date") Тогда 
							НовЭлем.Дата = Дата(Лев(Структ.Date, 4), Сред(Структ.Date, 6, 2), Сред(Структ.Date, 9, 2),
							Сред(Структ.Date, 12, 2), Сред(Структ.Date, 15, 2), Сред(Структ.Date, 18, 2));
						КонецЕсли;
						
						Если Структ.Свойство("Кошелек") Тогда 
							НовЭлем.Кошелек = Справочники.Кошельки.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Кошелек));
						КонецЕсли;
						
						Если Структ.Свойство("ТипОперации") Тогда 
							НовЭлем.ТипОперации = Перечисления.ТипыОпераций[Структ.ТипОперации];
						КонецЕсли;
						
						Если Структ.Свойство("Статья") Тогда 
							НовЭлем.Статья = Справочники.Статьи.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Статья));
						КонецЕсли;
						
						Если Структ.Свойство("КошелекПриемник") Тогда 
							НовЭлем.КошелекПриемник = Справочники.Кошельки.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.КошелекПриемник))
						КонецЕсли;

						Если Структ.Свойство("Физлицо") Тогда 
							НовЭлем.Физлицо = Справочники.ФизЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Физлицо));
						КонецЕсли;
						
						Если Структ.Свойство("ТипДолга") И ЗначениеЗаполнено(Структ.ТипДолга) Тогда 
							НовЭлем.ТипДолга = Перечисления.ТипыДолгов[Структ.ТипДолга];
						КонецЕсли;
						
						Если Структ.Свойство("Основание") Тогда 
							НовЭлем.Основание = Документы.Операция.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Основание));
						КонецЕсли;
						
						Если Структ.Свойство("Валюта") Тогда 
							НовЭлем.Валюта = Справочники.Валюты.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Валюта));
							
							Если не ЗначениеЗаполнено(НовЭлем.Валюта) Тогда 
								НовЭлем.Валюта = ?(ЗначениеЗаполнено(НовЭлем.Кошелек.Валюта), НовЭлем.Кошелек.Валюта,
								ЗначениеНаСтроекПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета"))
							КонецЕсли;
						КонецЕсли;
						
						Если Структ.Свойство("Метка") Тогда 
							НовЭлем.Метка = Справочники.Метки.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Метка));
						КонецЕсли;
						
						Если Структ.Свойство("Метка1") Тогда 
							НовЭлем.МеткаОтправитель = Справочники.Метки.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.Метка1));
						КонецЕсли;
						
						Если Структ.Свойство("МеткаОтправитель") Тогда 
							НовЭлем.МеткаОтправитель = Справочники.Метки.ПолучитьСсылку(Новый УникальныйИдентификатор(Структ.МеткаОтправитель));
						КонецЕсли;
						
						НовЭлем.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
 
    ЧтениеXML.Закрыть();	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '{СтандартныеПодсистемы.ДлительныеОперации}100'"));
КонецФункции

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт 
	
	ТекстОтносительнойДатыБекапа = "";
	
	Параметры.Вставить("НеобходимаВыгрузкаБекапаНаПочту", БекапЧерезПочту.ПроверитьНеобходимостьВыгрузкиБекапаНаПочту(ТекстОтносительнойДатыБекапа));
	Параметры.Вставить("ТекстОтносительнойДатыБекапа", ТекстОтносительнойДатыБекапа);	
	
КонецПроцедуры

Функция ИнициализацияМенеджеров()

	Менеджеры = Новый Соответствие;
	
	МенеджерыДляПлановОбмена = Новый Соответствие;
    	
	// ССЫЛКИ
	
	Для каждого ОбъектМД Из Метаданные.Справочники Цикл
		
		ДополнитьМассивМенеджеровСсылочнымТипом(Менеджеры, МенеджерыДляПлановОбмена, ОбъектМД, "Справочник", Справочники[ОбъектМД.Имя], "СправочникСсылка", Истина);
					
	КонецЦикла;
	
	ИмяТипа = "Перечисление";
	
	Для каждого ОбъектМД Из Метаданные.Перечисления Цикл
		
		Имя              = ОбъектМД.Имя;
		Менеджер         = Перечисления[Имя];
		ТипСсылкиСтрокой = "ПеречислениеСсылка." + Имя;
		ТипСсылки        = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,ПКО,ПустаяСсылка,ВозможенПоискПоПредопределенным", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, , Перечисления[Имя].ПустаяСсылка(), Ложь);
		Менеджеры.Вставить(ТипСсылки, Структура);
		
	КонецЦикла;
	
	Возврат Менеджеры;
	
КонецФункции

Процедура ДополнитьМассивМенеджеровСсылочнымТипом(Менеджеры, МенеджерыДляПлановОбмена, ОбъектМД, ИмяТипа, Менеджер, ПрефиксИмениТипа, ВозможенПоискПоПредопределенным = Ложь)
	
	Имя              = ОбъектМД.Имя;
	ТипСсылкиСтрокой = ПрефиксИмениТипа + "." + Имя;
	СтрокаПоиска     = "ВЫБРАТЬ Ссылка ИЗ " + ИмяТипа + "." + Имя + " ГДЕ ";
	ТипСсылки        = Тип(ТипСсылкиСтрокой);
	Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ОбъектМД,СтрокаПоиска,ВозможенПоискПоПредопределенным,ПКО", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ОбъектМД, СтрокаПоиска, ВозможенПоискПоПредопределенным);
	Менеджеры.Вставить(ТипСсылки, Структура);
	
	
	СтруктураДляПланаОбмена = Новый Структура("Имя,ТипСсылки,ЭтоСсылочныйТип,ЭтоРегистр", Имя, ТипСсылки, Истина, Ложь);
	МенеджерыДляПлановОбмена.Вставить(ОбъектМД, СтруктураДляПланаОбмена);
	
КонецПроцедуры
